Revit 2027 API
BuiltInFailures.BendFailures.NotBentSymbolicLine Property
 While making curved beam type "[Type Name]" some Symbolic Line elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentSymbolicLine { get; }
Public Shared ReadOnly Property NotBentSymbolicLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentSymbolicLine {
	FailureDefinitionId^ get ();
}
static member NotBentSymbolicLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace